
ancient_language_sl = {'а': 'ᥲ', 'б': 'δ', 'в': 'ʙ', 'г': 'ᴦ', 'д': 'д', 'е': 'ᥱ', 'ё': 'ё', 'ж': 'ж', 'з': 'ɜ', 'и': 'ᥙ',
                  'й': 'ᥔ', 'к': 'κ', 'л': '᧘', 'м': 'ʍ', 'н': 'н', 'о': '᧐', 'п': 'ᥰ', 'р': 'ρ', 'с': 'ᥴ', 'т': 'ᴛ',
                  'у': 'у', 'ф': 'ɸ', 'х': 'х', 'ц': 'ц', 'ч': 'ч', 'ш': 'ɯ', 'щ': 'щ', 'ъ': 'ъ', 'ы': 'ы', 'ь': 'ь',
                  'э': '϶', 'ю': 'ю', 'я': 'я', 'А': 'А', 'Б': 'Б', 'В': 'В', 'Г': '𐌲', 'Д': 'Д', 'Е': 'Е', 'Ё': 'Ё',
                  'Ж': 'Ж', 'З': 'З', 'И': 'И', 'Й': 'Й', 'К': '𐌺', 'Л': 'Л', 'М': 'М', 'Н': 'Н', 'О': 'О', 'П': '𐌿',
                  'Р': 'Р', 'С': 'С', 'Т': 'Т', 'У': 'У', 'Ф': 'Ф', 'Х': 'Х', 'Ц': 'Ц', 'Ч': 'Կ', 'Ш': 'Ш', 'Щ': 'Щ',
                  'Ъ': 'Ъ', 'Ы': 'Ы', 'Ь': 'Ь', 'Э': 'Э', 'Ю': 'Ю', 'Я': 'Я'}
font_for_spell = {'a': 'ᗩ', 'b': 'ᗷ', 'c': 'ᑕ', 'd': 'ᗞ', 'e': 'ᗴ', 'f': 'ᖴ', 'g': 'ꮆ', 'h': 'ᕼ', 'i': 'ꮖ', 'j': 'ᒍ',
                  'k': 'ꮶ', 'l': 'ꮮ', 'm': 'ᗰ', 'n': 'ᑎ', 'o': 'ᓂ', 'p': 'ᑭ', 'q': 'ᑫ', 'r': 'ᖇ', 's': 'ᔑ', 't': 'ꭲ',
                  'u': 'ᑌ', 'v': 'ᐯ', 'w': 'ᗯ', 'x': '᙭', 'y': 'ꭹ', 'z': 'ᔐ', 'A': 'ᗩ', 'B': 'ᗷ', 'C': 'ᑕ', 'D': 'ᗞ',
                  'E': 'ᗴ', 'F': 'ᖴ', 'G': 'Ꮆ', 'H': 'ᕼ', 'I': 'Ꮖ', 'J': 'ᒍ', 'K': 'Ꮶ', 'L': 'Ꮮ', 'M': 'ᗰ', 'N': 'ᑎ',
                  'O': 'ᓂ', 'P': 'ᑭ', 'Q': 'ᑫ', 'R': 'ᖇ', 'S': 'ᔑ', 'T': 'Ꭲ', 'U': 'ᑌ', 'V': 'ᐯ', 'W': 'ᗯ', 'X': '᙭',
                  'Y': 'Ꭹ', 'Z': 'ᔐ'}


def italics(text):
    return '<i>' + text + '</i>'


def bold(text):
    return '<b>' + text + '</b>'


def underlined(text):
    return '<u>' + text + '</u>'


def ancient_language(text):
    new = ''
    for letter in text:
        if letter in ancient_language_sl:
            new += ancient_language_sl[letter]
        else:
            new += letter
    return new


def spell_font(text):
    new = ''
    for letter in text:
        if letter in font_for_spell:
            new += font_for_spell[letter]
        else:
            new += letter
    return new
